IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_ECAP4_CONTROLSS_ECAP4.xml
	<register id="CONTROLSS_ECAP4_MUNIT_2_SHADOW_CTL" acronym="CONTROLSS_ECAP4_MUNIT_2_SHADOW_CTL" offset="0x104" width="32" description="">
		<bitfield id="LOADMODE" width="1" begin="2" end="2" resetval="0x0" description="Load mode 0 : Active registers are loaded with shadow on next sync event  1 : Active registers are loaded with shadow on EPWMx.GLDLCSTRB event" range="2" rwaccess="RW"/> 
		<bitfield id="SWSYNC" width="1" begin="1" end="1" resetval="0x0" description="Copies Min and Max values from shadow to active registers immediately if MUNIT_2_SHADOW_CTL.SYNCI_EN is set." range="1" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SYNCI_EN" width="1" begin="0" end="0" resetval="0x0" description="Shadow Enable 0 : Disabled 1 : Enabled" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP4_MUNIT_2_MIN" acronym="CONTROLSS_ECAP4_MUNIT_2_MIN" offset="0x110" width="32" description="">
		<bitfield id="MIN_VALUE" width="32" begin="31" end="0" resetval="0x0" description="Minimum value for monitoring" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP4_MUNIT_2_MAX" acronym="CONTROLSS_ECAP4_MUNIT_2_MAX" offset="0x114" width="32" description="">
		<bitfield id="MAX_VALUE" width="32" begin="31" end="0" resetval="0x0" description="Maximum value for monitoring" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP4_MUNIT_2_MIN_SHADOW" acronym="CONTROLSS_ECAP4_MUNIT_2_MIN_SHADOW" offset="0x118" width="32" description="">
		<bitfield id="MIN_VALUE_SHADOW" width="32" begin="31" end="0" resetval="0x0" description="Shadow minimum value for monitoring. Shadow value is loaded to active register on Sync event or global load strobe." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP4_MUNIT_2_MAX_SHADOW" acronym="CONTROLSS_ECAP4_MUNIT_2_MAX_SHADOW" offset="0x11C" width="32" description="">
		<bitfield id="MAX_VALUE_SHADOW" width="32" begin="31" end="0" resetval="0x0" description="Shadow maximum value for monitoring. Shadow value is loaded to active register on Sync event or global load strobe." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP4_MUNIT_2_DEBUG_RANGE_MIN" acronym="CONTROLSS_ECAP4_MUNIT_2_DEBUG_RANGE_MIN" offset="0x120" width="32" description="">
		<bitfield id="MIN_VALUE" width="32" begin="31" end="0" resetval="0x4294967295" description="Observed Min value of check being enabled on minotoring unit 2. Is updated when MUNIT_2_CTL.DEBUG_RANGE_EN is set to '1'" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ECAP4_MUNIT_2_DEBUG_RANGE_MAX" acronym="CONTROLSS_ECAP4_MUNIT_2_DEBUG_RANGE_MAX" offset="0x124" width="32" description="">
		<bitfield id="MAX_VALUE" width="32" begin="31" end="0" resetval="0x0" description="Observed Min value of check being enabled on minotoring unit 2. Is updated when MUNIT_2_CTL.DEBUG_RANGE_EN is set to '1'" range="31 - 0" rwaccess="RO"/>
	</register>
</module>